Revit 2027 API
TrussMemberInfo.memberTypeKey Property
Kind of the member in the truss.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TrussMemberType memberTypeKey { get; set; }
Public Property memberTypeKey As TrussMemberType
	Get
	Set
public:
property TrussMemberType memberTypeKey {
	TrussMemberType get ();
	void set (TrussMemberType value);
}
member memberTypeKey : TrussMemberType with get, set
Property Value
TrussMemberType
See Also
Reference
TrussMemberInfo Class
Autodesk.Revit.DB.Structure Namespace